"use strict"
function getCookie(name) {
    let cookieValue = null;
    if (document.cookie && document.cookie !== '') {
        const cookies = document.cookie.split(';');
        for (let i = 0; i < cookies.length; i++) {
            const cookie = cookies[i].trim();
            if (cookie.substring(0, name.length + 1) === (name + '=')) {
                cookieValue = decodeURIComponent(cookie.substring(name.length + 1));
                break;
            }
        }
    }
    return cookieValue;
}

const fileInput = document.getElementById("fileInput");
const dropzonePreview = document.getElementById("dropzone-preview");

function removeListItem(listItem) {
    dropzonePreview.removeChild(listItem);
}

fileInput.addEventListener("change", function() {
    dropzonePreview.innerHTML = "";

    const selectedFiles = fileInput.files;

    for (let i = 0; i < selectedFiles.length; i++) {
        const listItem = document.createElement("li");
        listItem.classList.add("mt-2", "dz-processing", "dz-image-preview", "dz-success", "dz-complete");

        const imageContainer = document.createElement("div");
        imageContainer.classList.add("border", "rounded");

        const flexContainer = document.createElement("div");
        flexContainer.classList.add("d-flex", "p-2");

        const imageDiv = document.createElement("div");
        imageDiv.classList.add("flex-shrink-0", "me-3");
        const imageThumbnail = document.createElement("div");
        imageThumbnail.classList.add("avatar-sm", "bg-light", "rounded");
        const imageElement = document.createElement("img");
        imageElement.setAttribute("data-dz-thumbnail", "");
        imageElement.classList.add("img-fluid", "rounded", "d-block");
        imageElement.src = URL.createObjectURL(selectedFiles[i]);
        imageThumbnail.appendChild(imageElement);
        imageDiv.appendChild(imageThumbnail);

        const textContainer = document.createElement("div");
        textContainer.classList.add("flex-grow-1", "pt-1");

        const fileNameHeader = document.createElement("h5");
        fileNameHeader.classList.add("fs-14", "mb-1");
        fileNameHeader.setAttribute("data-dz-name", "");
        fileNameHeader.textContent = selectedFiles[i].name;

        const fileSize = document.createElement("p");
        fileSize.classList.add("fs-13", "text-muted", "mb-0");
        fileSize.setAttribute("data-dz-size", "");
        fileSize.innerHTML = `<strong>${(selectedFiles[i].size / 1024).toFixed(1)} MB</strong>`;

        const errorMessage = document.createElement("strong");
        errorMessage.classList.add("error", "text-danger");
        errorMessage.setAttribute("data-dz-errormessage", "");

        textContainer.appendChild(fileNameHeader);
        textContainer.appendChild(fileSize);
        textContainer.appendChild(errorMessage);

        const deleteButtonDiv = document.createElement("div");
        deleteButtonDiv.classList.add("flex-shrink-0", "ms-3");
        const deleteButton = document.createElement("button");
        deleteButton.setAttribute("data-dz-remove", "");
        deleteButton.classList.add("btn", "btn-sm", "btn-danger");
        deleteButton.textContent = "Delete";

        deleteButton.addEventListener("click", function(event) {
            event.preventDefault();
            removeListItem(listItem);
        });

        deleteButtonDiv.appendChild(deleteButton);

        flexContainer.appendChild(imageDiv);
        flexContainer.appendChild(textContainer);
        flexContainer.appendChild(deleteButtonDiv);

        imageContainer.appendChild(flexContainer);
        listItem.appendChild(imageContainer);

        dropzonePreview.appendChild(listItem);
    }
});

var widgets = [
            'outside_factors',
            'neighbour_zones',
            'building_age',
            'building_type',
            'pest_secure_structure',
            'present_gaps',
            'communal_entry_points',
            'basements',
            'empty_suspended_ceilings',
            'is_waterproof',
            'quality_sewage',
            'unreachable_zones',
            'unreachable_roofs',
            'pest_pattern_review',
            'pest_hot_spots_review',
            'risk_of_pests_returning',
            'is_service_review_required',
            'practice_standards',
            'practice_exclusion',
            'is_contract_applicable',
            'is_service_frequency_applicable',
            'is_ewk_frequency_applicable',
            'is_extra_insect_monitoring_required',
            'is_frequent_biologist_visit_required',
            'is_yearly_pest_management_check_required',
            'does_waste_handling_exist',
            'garbage_distance_to_the_building',
            'waste_handling_zones_comment',
            'high_risk_zones',
            'are_fly_control_measures_active',
            'are_fly_control_limits_set',
            'fly_control_history',
            'high_risk_food_product_zones',
            'high_risk_food_production_zones',
            'equipment_fly_activity',
            'does_program_for_monitoring_exists',
            'is_untoxic_monitoring_conducted',
            'is_pest_control_proactive',
            'ewk_placement',
            'ewk_accordance',
            'ewk_equipment',
            'is_ewk_frequency_satisfactory',
            'measures_to_block_insects_from_getting_inside',
            'crawling_insects_history',
            'psocoptera_monitoring',
            'acheta_domesticus_monitoring',
            'cockroach_history',
            'blattella_germanica_history',
            'blatta_orientalis_history',
            'is_spi_monitoring_applied',
            'which_zones_are_covered_from_spi',
            'are_all_spi_risks_reviewed',
    ];

const sections = {
    1: {
            title: 'Чинники навколишнього середовища (екологічні)',
            outside_factors:{
                number: 1.1,
                factors: 'Навколишнє середовище/\n' +
                    'місцерозташування:\n' +
                    'промислова/міська/сільська/\n' +
                    'агро місцевість.',
                reason: 'Різні параметри навколишнього середовища впливають\n' +
                    'на ризик виникнення активності шкідників, що може\n' +
                    'сформу-ватися на об’єкті. Навколишня обстановка\n' +
                    'на кожному об\'єкті є унікальною, і це слід враховувати\n' +
                    'при проведенні ОООРШО.'
            }
        },
    2: {
            title: 'Близькість об\'єкту до сусідніх зон високого ризику',
            neighbour_zones:{
                number: 2.1,
                factors: 'Чи є ділянка прилеглою до:\n' +
                    'Водні об\'єкти/ Залізничні лінії/\n' +
                    'Об’єкти переробки відходів/\n' +
                    'Місця обробки води/\n' +
                    'Густе лісове господарство',
                reason: 'Ці зони є важливими факторами, які можуть впливати\n' +
                    'на наявність активності шкідників, діючи в якості\n' +
                    'резервуарів для перебування шкідників, або шляхом\n' +
                    'надання шляху/можливості проникнення для гризунів\n' +
                    'або літаючих комах на сусідній об’єкт. Наявність\n' +
                    'цих зон може вплинути на форму моніторингу шкідливих\n' +
                    'організмів та програму боротьби з шкідниками. Вони\n' +
                    'можуть впливати на кількість або місце розташування\n' +
                    'моніторингових засобів для шкідливого організму та\n' +
                    'навіть – впливати на місця концентрації засобів\n' +
                    'моніторингу активності гризунів назовні, наприклад,\n' +
                    'для перехоплення вхідної активності гризунів.\n' +
                    'Лісові райони та водотоки можуть призвести до\n' +
                    'того, що невеликі літаючі комахи переносяться\n' +
                    'повітряними потоками в приміщення.'
            }
        },
    3: {
            title: 'Тип будівлі',
            building_age:{
                number: 3.1,
                factors: 'Чи споруда: Стара/ Нова/\n' +
                    'Побудована для цільового\n' +
                    'використання/ Модифікована\n' +
                    '(конвертована/\n' +
                    'перероблена) для\n' +
                    'використання.',
                reason: 'У старих будівлях стіни, підлога та дах можуть бути\n' +
                    'сприйнятливими до активності шкідників. Це може\n' +
                    'забезпечити більш легкий доступ для шкідників, щоб\n' +
                    'проникати через щілини, прогалини та отвори в\n' +
                    'будівлю або проникати в порожнини стін і т. д. Нові\n' +
                    'та побудовані для цільового використання об\'єкти,\n' +
                    'представляють менший ризик надходження шкідників\n' +
                    'через стіни, підлогу та дах, оскільки вони, зазвичай,\n' +
                    'розроблені для зменшення ризику проникнення\n' +
                    'шкідників і встановлення популяції шкідників у\n' +
                    'будівлі. Наприклад, зовнішні металеві облицювальні\n' +
                    'панелі з надійно загерметизованою основою\n' +
                    'ефективні проти проникнення гризунів.'
            },
            building_type:{
                number: 3.2,
                factors: 'Будівля: Відокремлена або\n' +
                    '"Загальна" (примикає до сусідніх\n' +
                    'приміщень/є частиною\n' +
                    'комплексу фізично з’єднаних\n' +
                    'будівель).',
                reason: '«Загальна» будівля значно збільшує ризик зараження\n' +
                    'з сусідніх приміщень, оскільки шкідники можуть переміщатися\n' +
                    'з однієї будівлі до іншої. Якщо у сусідній будівлі присутні\n' +
                    'шкідники, а також недостатні або відсутні заходи щодо\n' +
                    'попередження проблем зі шкідливими організмами, це\n' +
                    'значно збільшить ризик міграції шкідників з одного\n' +
                    'об’єкту в інший. Це може відбуватися уздовж кабельних\n' +
                    'і трубопроводів, через порожнини у стінах або через\n' +
                    'сполучені порожнини даху та порожнини під підлогою.'
            },
        },
    4: {
            title: 'Структура будівлі та зони високого ризику',
            pest_secure_structure:{
                number: 4.1,
                factors: 'Чи допомагає стан зовнішньої\n' +
                    'частини стін, підлоги, даху\n' +
                    'будівлі та якість герметизації\n' +
                    'утримувати шкідників від\n' +
                    'потрапляння всередину будівлі?',
                reason: 'Необхідна висока якість захисту від проникнення шкідників\n' +
                    'та хороша дисципліна використання дверей (вчасно зачиняти).\n' +
                    'Якщо в зовнішній частині стін, підлоги, даху будівлі присутні\n' +
                    'порожнини, отвори та прогалини, існує небезпека проникнення\n' +
                    'шкідників у будівлю. Наявність настінної облицювальної\n' +
                    'оболонки або зовнішніх утеплюючих шарів може створити\n' +
                    '"подвійну оболонку", яка забезпечує притулок/оселище для\n' +
                    'гризунів і дозволяє їм підніматися в будівлю.'
            },
            present_gaps:{
                number: 4.2,
                factors: 'Чи присутні прогалини чи\n' +
                    'пустоти/порожнини?',
                reason: 'Наявність порожнин у стінах та покрівлі (даху, стелі)\n' +
                    'створює значний ризик розвитку активності шкідників,\n' +
                    'особливо якщо вони пов\'язані з сусідніми об’єктами.'
            },
            communal_entry_points:{
                number: 4.3,
                factors: 'Наявність порожнин у стінах та покрівлі (даху, стелі)\n' +
                    'створює значний ризик розвитку активності шкідників,\n' +
                    'особливо якщо вони пов\'язані з сусідніми об’єктами.',
                reason: 'Відкриті трубопроводи, через які проходять труби або\n' +
                    'кабелі з вулиці ззовні, створюють значний ризик\n' +
                    'потрапляння шкідників. Труби та кабелі часто використовуються\n' +
                    'шкідниками як шляхи проникнення до будівель, аналогічно і\n' +
                    'вентиляційна система. Ці ділянки повинні бути перевірені, і\n' +
                    'будь-які прогалини загерметизовані. Моніторинг рекомендується.\t\n'
            },
            basements:{
                number: 4.4,
                factors: 'Підвальні приміщення\nта спільні підвали',
                reason: 'Підвальні приміщення можуть забезпечити джерело оселища\n' +
                    'для шкідників, якщо не буде проводитися моніторинг. Спільні\n' +
                    'підвали можуть дозволити шкідникам рухатися між будівлями.\t\n'
            },
            empty_suspended_ceilings:{
                number: 4.5,
                factors: 'Пустоти підвісних стель',
                reason: 'Підвісні стелі можуть забезпечити оселище для шкідників.\n' +
                    'Вони можуть забезпечити джерело активності гризунів або\n' +
                    'тарганів, сприяючи зростанню кількості шкідників\n' +
                    'непомітно/невиявлено і зараженню нижчих зон на\n' +
                    'рівні землі. У зонах, де існувала історія активності\n' +
                    'шкідливих організмів, рекомендується підвищений рівень\n' +
                    'моніторингу.'
            },
            is_waterproof:{
                number: 4.6,
                factors: 'Чи є будівля водонепроникною?',
                reason: 'Протікаючі будівлі можуть пошкодити запаси та створювати\n' +
                    'внутрішньо вологі середовища, придатні для безхребетних,\n' +
                    'таких як сіноїди або мухи. Вони можуть згодом заразити\n' +
                    'піддони/палети, упаковку або готовий продукт.'
            },
            quality_sewage:{
                number: 4.7,
                factors: '\tЧи є якісний дренаж/стік\n' +
                    '(каналізація) всередині будівлі?',
                reason: 'Погана якість дренажу або ділянки стоячої води можуть\n' +
                    'призвести до активності літаючих комах, таких як мухи та\n' +
                    'інші дрібні безхребетні, які можуть з\'явитися у великій кількості.\n' +
                    'Відповідні заходи моніторингу слід використовувати для\n' +
                    'виявлення спалахів великої кількості літаючих комах. Це\n' +
                    'також підкреслитьнеобхідність усунення стоячої води\n' +
                    'або очищення стоку в локалізованих зонах.'
            },

        },
    5: {
            title: 'Структура будівлі та графіки прибирання',
            unreachable_zones:{
                number: 5.1,
                factors: 'Чи існують недоступні зони\n' +
                    'високого ризику наявні у\n' +
                    'виробничій зоні, такі як\n' +
                    'виступи на високому рівні\n' +
                    'або горизонтальні поверхні\n' +
                    'вгорі?',
                reason: 'Відносно-недоступні зони на високому рівні може бути важко\n' +
                    'очищати та інспектувати на регулярній основі, що дозволяє\n' +
                    'непомітно розвинутись активності шкідливих комах чи гризунів\n' +
                    'та поширюватися на прилеглі зони. Ці зони можуть представляти\n' +
                    'значний ризик розвитку активності шкідників, особливо в\n' +
                    'середовищах з пилом із сухих харчових продуктів. Для\n' +
                    'моніторингу та контролю необхідно забезпечити належний\n' +
                    'розклад прибирання та інспекцій. Якщо можливо, встановіть\n' +
                    'моніторингові пастки в деяких відносно-недоступ-них зонах\n' +
                    'для періодичної перевірки.'
            },
            unreachable_roofs:{
                number: 5.2,
                factors: 'Чи наявні плоскі дахи\n' +
                    'або порожнини вгорі, що\n' +
                    'недоступні для прибирання?',
                reason: 'Ці зони можуть забезпечити ідеальні умови для встановлення\n' +
                    'активності шкідливих організмів, а також для непомітного\n' +
                    'збільшення кількості шкідників. Тому вони несуть ризик\n' +
                    'зараження прилеглих територій.'
            },
        },
    6: {
            title: 'Попередня історія активності шкідників',
            pest_pattern_review:{
                number: 6.1,
                factors: 'Перегляд паттерну\n' +
                    'попередньої активності\n' +
                    'шкідливих організмів.',
                reason: 'Грунтуючись на історії активності шкідників, може\n' +
                    'знадобитися перегляд наявних заходів щодо моніторингу\n' +
                    'шкідливих організмів та обробок. Візьміть до уваги чи\n' +
                    'історія та частота випадків зі шкідниками вказують на\n' +
                    'необхідність збільшення частоти сервісних відвідувань\n' +
                    '(наприклад, збільшення кількості регулярних візитів з\n' +
                    'кожних 2 тижнів до 1 тижня).'
            },
            pest_hot_spots_review:{
                number: 6.2,
                factors: 'Чи наявна попередня історія\n' +
                    'активності шкідників або зони\n' +
                    '"гарячих точок"?',
                reason: 'Перевірте чи були введені відповідні моніторингові\n' +
                    'та контрольні заходи для зменшення ризику\n' +
                    'повторного виникнення інциденту зі шкідниками.'
            },
            risk_of_pests_returning:{
                number: 6.3,
                factors: 'Який ризик того, що\n' +
                    'критична активність\n' +
                    'шкідників відбудеться знову?',
                reason: 'Подумайте, як давно стався інцидент, де, чому,\n' +
                    'його причини і якою була його важкість (наслідки)?\n' +
                    'Чи існував ризик безпечності харчових продуктів\n' +
                    'унаслідок попереднього інциденту зі шкідниками?\n' +
                    'Чи призвело це до скарги клієнта або ж виникли\n' +
                    'суттєві економічні витрати? Необхідно забезпечити\n' +
                    'належні запобіжні заходи, щоб уникнути\n' +
                    'повторення критичного інциденту зі шкідливим\n' +
                    'організмом.'
            },
            is_service_review_required:{
                number: 6.4,
                factors: 'Чи вимагається перегляд\n' +
                    'існуючої програми\n' +
                    'обслуговування?',
                reason: 'На підставі попередньої історії активності шкідників\n' +
                    'може знадобитися повний перегляд поточних\n' +
                    'практик/заходів моніторингу чи контролю\n' +
                    'шкідників на об’єкті.'
            },
        },
    7: {
            title: 'Кодекси практики',
            practice_standards:{
                number: 7.1,
                factors: 'Операційні стандарти\n' +
                    'компанії, нормативні\n' +
                    'стандарти та кодекси практики.',
                reason: 'Перевірте Операційні стандарти компанії, нормативні\n' +
                    'стандарти та кодекси практики, щоб переконатися\n' +
                    'у тому/забезпечити те, що запропонована програма\n' +
                    'комплексної боротьби зі шкідливими організмами є\n' +
                    'сумісною та ефективною для зниження ризику\n' +
                    'активності шкідливих організмів.'
            },
            practice_exclusion:{
                number: 7.2,
                factors: 'Наприклад: Кодекси практики,\n' +
                    'такі як Органічні стандарти\n' +
                    'або AIB, можуть обмежувати\n' +
                    'або виключати використання\n' +
                    'родентицидів на об’єкті.',
                reason: 'Для органічних або "нетоксичних" об’єктів існує багато\n' +
                    'варіантів нетоксичного моніторингу, і нетоксична\n' +
                    'система вимагатиме більш частої перевірки нетоксичних\n' +
                    'моніторингових засобів для гризунів. Тому наявність\n' +
                    'відповідно натренованого працівника з персоналу\n' +
                    '(Замовника) може знадобитися для зменшення\n' +
                    'навантаження додаткових відвідувань/перевірок,\n' +
                    'які в іншому випадку проводяться/виконуються\n' +
                    'підрядником з боротьби зі шкідниками. В ідеалі на\n' +
                    '"нетоксичних" об’єктах внутрішнє моніторингове\n' +
                    'обладнання для гризунів повинно перевірятися щотижня\n' +
                    'тренованою/кваліфікованою, компетентною людиною, а\n' +
                    'підрядник з боротьби з шкідниками повинен проводити\n' +
                    'відвідування не рідше, ніж кожні 4 тижні. Це відбувається\n' +
                    'через те, що більший інтервал між сервісними\n' +
                    'відвідуваннями занадто довгий, оскільки гризуни можуть\n' +
                    'встановити популяцію в будівлі.'
            },
        },
    8: {
            title: 'Договір про боротьбу зі шкідниками',
            is_contract_applicable:{
                number: 8.1,
                factors: 'Чи існуючий договір про\n' +
                    'боротьбу зі шкідниками є\n' +
                    'відповідним та задовільним?',
                reason: 'Чи договір на обслуговування все ще актуальний і придатний\n' +
                    'для цілей згідно вимог об’єкту?'
            },
            is_service_frequency_applicable:{
                number: 8.2,
                factors: 'Якщо виникали повторювані\n' +
                    'або хронічні проблеми зі\n' +
                    'шкідниками, чи частота\n' +
                    'сервісних відвідувань є\n' +
                    'відповідною для об’єкту?\n' +
                    'Чи потрібно збільшити кількість\n' +
                    'відвідувань?',
                reason: 'Базові договори про надання послуг по контролю шкідників\n' +
                    'зазвичай передбачають вісім сервісних візитів щороку (відвідування\n' +
                    'кожні шість тижнів) для гризунів та повзаючих комах. Проте,\n' +
                    'для більших, більш складних або високотехнологічних\n' +
                    'об’єктів може знадобитися дванадцять відвідувань на рік.'
            },
            is_ewk_frequency_applicable:{
                number: 8.3,
                factors: 'Чи достатня частота\n' +
                    'обслуговування ЕВК?',
                reason: 'Для ЕВК, зазвичай, є чотири сервісних відвідування у рік.\n' +
                    'Проте, для об’єктів з високим ризиком або де клеєві\n' +
                    'екрани в ЕВК швидко заповнюються мухами, частоту\n' +
                    'відвідувань можна збільшити до: (i) Дванадцяти\n' +
                    'сервісних візитів щороку. Або (іі) відвідування протягом\n' +
                    'тижня в теплі літні місяці, щоб забезпечити, щоб клеєві\n' +
                    'екрани в ЕВК залишалися ефективними для перехоплення\n' +
                    'мух.'
            },
            is_extra_insect_monitoring_required:{
                number: 8.4,
                factors: 'Чи потрібний моніторинг\n' +
                    'для комах-шкідників запасів\n' +
                    '(КШЗ)? Якщо так, чи існуючі\n' +
                    'моніторингові заходи\n' +
                    'розгорнуті належним чином?',
                reason: 'Зони високого ризику, такі як зони зберігання сировини\n' +
                    'та готових виробів, можуть вимагати моніторингу харчової\n' +
                    'молі/вогнівок, або повзаючих шкідників. Існує високий ризик\n' +
                    'активності КШЗ в зонах сухих харчових продуктів, сухих\n' +
                    'порошків харчових продуктів та місцях виробництва корму\n' +
                    'для домашніх тварин. У таких зонах, як пекарні та млини,\n' +
                    'може знадобитися моніторинг КШЗ у зонах, що прилягають\n' +
                    'до виробничого обладнання. Це висвітлить ризик будь-якого\n' +
                    'підвищення активності комах, а також вкаже на необхідність\n' +
                    'цілеспрямованого очищення, щоб зменшити ризик збільшення\n' +
                    'активності КШЗ. Як правило, феромонні пастки для молі\n' +
                    'обслуговуються не менше восьми разів на рік.'
            },
            is_frequent_biologist_visit_required:{
                number: 8.5,
                factors: 'Чи передбачений періодичний\n' +
                    'аудит біолога або технічний\n' +
                    'аудит? Чи частота\n' +
                    'інспекцій/цих візитів підходить\n' +
                    'для потреб об’єкту?',
                reason: 'Зазвичай, на високотехнологічних об’єктах, інспекції\n' +
                    'біолога або технічні інспекції проводяться один,\n' +
                    'два або чотири рази на рік.'
            },
            is_yearly_pest_management_check_required:{
                number: 8.6,
                factors: 'Чи існує будь-яке положення\n' +
                    'для щорічної незалежної\n' +
                    'аудиторської перевірки для\n' +
                    'оцінки та верифікації\n' +
                    'Стандарту якості Програми\n' +
                    'пест менеджменту?',
                reason: 'Об\'єктивні незалежні аудити допомагають забезпечити\n' +
                    'безперервний розвиток програми боротьби з шкідниками на об’єкті.\t\n'
            },
        },
    9: {
            title: 'Поводження з відходами',
            does_waste_handling_exist:{
                number: 9.1,
                factors: 'Чи існують належні операційні\n' +
                    'стандарти для поводження з\n' +
                    'відходами на об’єкті?',
                reason: 'Чи умови для зберігання та видалення відходів відповідні?\n' +
                    'Чи графіки прибирання є ефективними для видалення\n' +
                    'розсипів/розливів?'
            },
            garbage_distance_to_the_building:{
                number: 9.2,
                factors: 'Наскільки близька зона для\n' +
                    'поводження з відходами до\n' +
                    'будівлі?',
                reason: 'Якщо примикає до зовнішнього периметру будівлі, чи можна\n' +
                    'перемістити місце зберігання відходів?'
            },
            waste_handling_zones_comment:{
                number: 9.3,
                factors: 'Зони поводження з відходами\n' +
                    'приваблюють шкідників та\n' +
                    'забезпечують оселище для\n' +
                    'гризунів та комах-шкідників',
                reason: 'Чи застосовуються належні заходи моніторингу та контролю\n' +
                    'зовнішньої активності гризунів у місцях поводження з\n' +
                    'відходами? Чи є відповідні заходи щодо боротьби з\n' +
                    'літаючими комахами (мухами) всередині будівлі, що\n' +
                    'прилягає до зон поводження з відходами?'
            },
        },
    10: {
            title: 'Ділянки (виробничих) процесів - зони високого ризику',
            high_risk_zones:{
                number: 10.1,
                factors: 'Зони високого ризику. Мухи\n' +
                    'представляють значний ризик\n' +
                    'у харчових зонах високого\n' +
                    'ризику, особливо там, де є\n' +
                    'готові продукти харчування.\n' +
                    'Це тому, що мухи є векторами\n' +
                    'харчових патогенів, і в зонах\n' +
                    'високого ризику їжа може\n' +
                    'підтримувати зростання\n' +
                    'патогенних мікроорганізмів,\n' +
                    'перенесених мухами. Таке\n' +
                    'мікробне зараження\n' +
                    'становить ризик для здоров\'я\n' +
                    'людей, оскільки продукти\n' +
                    'харчування можуть не\n' +
                    'піддаватися подальшим\n' +
                    'обробкам, які в іншому\n' +
                    'випадку знищують\n' +
                    'патогенні мікроорганізми\n' +
                    'перед їх споживанням.',
                reason: 'Обмежене використання моніторингових засобів для\n' +
                    'шкідливих організмів у зоні підвищеного ризику\n' +
                    'покладається на якісні візуальні огляди/інспекції стін,\n' +
                    'підлоги, стелі/даху будівлі, стоків та виробничого\n' +
                    'обладнання. Моніторингові засоби для шкідників і\n' +
                    'ЕВК можуть бути стратегічно розміщені в сусідніх\n' +
                    'зонах меншого значення (ризику) для перехоплення\n' +
                    'гризунів або літаючих комах, перш ніж вони потраплять\n' +
                    'у зони високого ризику. Коли ЕВК розміщуються в\n' +
                    'середовищі високого ризику, їх метою є\n' +
                    'продемонструвати відсутність активності літаючих\n' +
                    'комах та перехопити будь-яких окремих поодиноких\n' +
                    'мух, які можуть проникнути в зону.'
            },
            are_fly_control_measures_active:{
                number: 10.2,
                factors: 'Чи застосовуються належні\n' +
                    'заходи щодо контролю мух\n' +
                    'для перехоплення активності\n' +
                    'літаючих комах?',
                reason: 'Мухи можуть залітати з сусідніх областей з низьким\n' +
                    'рівнем ризику, таких як зони обробки або упаковки,\n' +
                    'зовнішніх дверних прорізів, проходів чи від сміттєвих\n' +
                    'баків.'
            },
            are_fly_control_limits_set:{
                number: 10.3,
                factors: 'Області високого ризику -\n' +
                    'критичні порогові ліміти. Чи\n' +
                    'встановлені критичні граничні\n' +
                    'межі (ліміти) для літаючих\n' +
                    'комах?',
                reason: 'Критичні граничні межі для активності літаючих комах\n' +
                    'мають бути низькими. Щоб забезпечити належні\n' +
                    '"безпечні межі" або "прийнятні ліміти", рекомендовано\n' +
                    'переглянути попередню активність літаючих комах та\n' +
                    'переглянути критичні граничні межі (ліміти).'
            },
            fly_control_history:{
                number: 10.4,
                factors: 'Зони високого ризику - історія\n' +
                    'активності літаючих комах.',
                reason: 'Визначте первинне джерело попередної активності\n' +
                    'літаючих комах. Зовнішні джерела можуть призвести\n' +
                    'до виникнення більшої кількості м’ясних/падальних мух\n' +
                    'або вогнівок/молей, і внутрішнє джерело може призвести\n' +
                    'до виникнення більшої кількості дренажних мух або\n' +
                    'дрозофіл (фруктових мух). Оцініть, чи наявні належні\n' +
                    'контрольні заходи для зменшення ризику для готового продукту.\t\n'
            },
        },
    11: {
            title: 'Сировина та готова продукція',
            high_risk_food_product_zones:{
                number: 11.1,
                factors: 'Зони сухих харчових продуктів\n' +
                    'можуть бути сприйнятливими\n' +
                    'до широкого кола (комах-\n' +
                    'шкідників запасів) КШЗ. Харчові\n' +
                    'об’єкти, що особливо\n' +
                    'підпадають під ризик, - такі,\n' +
                    'що обробляють або\n' +
                    'переробляють наступні товари:\n' +
                    'рис, сухі овочі, трави,\n' +
                    'сухофрукти, какао-боби,\n' +
                    'горіхи, шоколад, зерно,\n' +
                    'продукти на основі злаків\n' +
                    'або сухі продукти харчування в\n' +
                    'порошках, такі як сухе молоко\n' +
                    'або дитяча суміш. Зони високого\n' +
                    'ризику включатимуть зони\n' +
                    'зберігання сировини, виробниче\n' +
                    'обладнання продуктів\n' +
                    'харчування та зони зберігання\n' +
                    'готової продукції.',
                reason: 'Переконайтеся, що для виявлення шкідників-комах, пов\'язаних\n' +
                    'із харчовими продуктими, які переробояються/ обробляються\n' +
                    'на об\'єкті, впроваджена належна стратегія моніторингу. Об\'єкти,\n' +
                    'що обробляють сухі харчові продукти, мають високий ризик\n' +
                    'активності харчової молі/вогнівки та жуків-шкідників запасів.\n' +
                    'Тому рекомендується переглядати існуючі заходи моніторингу\n' +
                    'КШЗ. Чи наявні моніторингові пастки для повзаючих шкідників\n' +
                    'запасів? Чи наявні моніторингові пастки для харчових вогнівок/молі?\n' +
                    'Чи адекватне розміщення моніторингових засобів для КШЗ? Чи тип\n' +
                    'застосовуваного моніторингового засобу для КШЗ є підходящим/доцільним\n' +
                    'для спостережуваних видів (наприклад, чи більш логічні феромонні пастки чи\n' +
                    'інший тип)?'
            },
        },
    12: {
            title: 'Виробниче обладнання',
            high_risk_food_production_zones:{
                number: 12.1,
                factors: 'Продукти харчування на\n' +
                    'основі зернових, м\'ясні та\n' +
                    'рибні продукти особливо\n' +
                    'привабливі для комах-\n' +
                    'шкідників. Таким чином, у\n' +
                    'виробничій зоні будь-які\n' +
                    'накопичені залишки їжі,\n' +
                    'присутні всередині виробничого\n' +
                    'обладнання, значно підвищують\n' +
                    'ризик розвитку активності\n' +
                    'комах-шкідників.',
                reason: 'На майданчиках виробництва продуктів харчування може виникнути значний ризик\n' +
                    'активності комах, коли: - виробниче обладнання для харчової промисловості\n' +
                    'працює постійно, і лише зупиняється короткочасно або рідко для можливості\n' +
                    'прибирання; - коли харчові залишки накопичуються в обладнанні харчової\n' +
                    'промисловості в зонах, де важко отримати доступ для частого очищення.\n' +
                    'Необхідно створити графік інспекцій виробничого обладнання і скоординувати\n' +
                    'доступ між підрядником з боротьби зі шкідниками, відділом гігієни, відділом\n' +
                    'електрики та інженерним відділом - щоб забезпечити доступ до виробничого\n' +
                    'обладнання високого ступеню ризику для більш частих прибирань та інспекцій,\n' +
                    'що проводитимуться протягом року.'
            },
        },
    13: {
            title: 'Устаткування та обладнання',
            equipment_fly_activity:{
                number: 13.1,
                factors: 'Активність КШЗ може бути\n' +
                    'пов\'язана з різними видами\n' +
                    'обладнання та устаткування.',
                reason: 'Обладнання високого ризику включатиме: - силоси, бункери, контейнери\n' +
                    'для зберігання сипучих продуктів, ваги, змішувачі,\n' +
                    'накопичуючо-транспортувальне обладнання, конвеєри\n' +
                    '(особливо менш доступні, накладні конвеєри) та пиловловлювачі.\n' +
                    'Додаткові зони включатимуть ділянки корпусу двигуна та електричні\n' +
                    'зони, такі як електричні шафи або електричні перемикачі. Щоб знизити\n' +
                    'ризик збільшення активності КШЗ: - повинні бути встановлені відповідні\n' +
                    'моніторингові пастки для повзаючих комах або феромонні пастки для\n' +
                    'харчової молі. Повинні бути складені графіки частого прибирання.\n' +
                    'Рекомендується скласти графік інспекції устаткування та обладнання.'
            },
        },
    14: {
            title: 'Моніторинг гризунів',
            does_program_for_monitoring_exists:{
                number: 14.1,
                factors: 'Чи наявна належна програма\n' +
                    'моніторингу та контролю\n' +
                    'гризунів?',
                reason: 'Запевніться, що впроваджений належний рівень моніторингу як у\n' +
                    'внутрішніх, так і в зовнішніх зонах. Переконайтеся, що вразливі\n' +
                    'області є належно захищеними (наприклад, зовнішні дверні\n' +
                    'прорізи та зони поводження з відходами).'
            },
            is_untoxic_monitoring_conducted:{
                number: 14.2,
                factors: 'Чи проводиться нетоксичний\n' +
                    'моніторинг?',
                reason: 'Можна використовувати різноманітні нетоксичні методи моніторингу -\n' +
                    'плацебо (нетоксична принада), механічні пастки або приманки для гризунів.\n' +
                    'В ідеалі використання більш ніж одного типу нетоксичного моніторингового\n' +
                    'засобу може збільшити рівень виявлення і може допомогти вказати на ранню\n' +
                    'присутність активності гризунів.'
            },
            is_pest_control_proactive:{
                number: 14.3,
                factors: 'Чи моніторинг гризунів є\n' +
                    'про-активним (націленим на\n' +
                    'попередження, профілактичним)\n' +
                    'та чи відображає зміни, які\n' +
                    'відбулися на об\'єкті?',
                reason: 'Об\'єкти - це динамічні середовища, які завжди забезпечують нові\n' +
                    'можливості для раптового виникнення активності шкідників. Нова\n' +
                    'активність шкідливих організмів може бути спричинена переміщенням\n' +
                    'великого обсягу піддонів, відкритими дверима, видаленням або\n' +
                    'встановленням нового виробничого обладнання, змінами методів\n' +
                    'виробництва/обробки та структурними змінами, такими як нові будівлі,\n' +
                    'будівництво та розширення на об\'єкті. Переконайтеся, що програма\n' +
                    'моніторингу та контролю шкідливих організмів є надійною, про-активною\n' +
                    '(націленою на попередження), адаптивною і оновлюваною, щоб\n' +
                    'відобразити будь-які зміни на об\'єкті.'
            },
        },
    15: {
            title: 'Літаючі комахи',
            ewk_placement:{
                number: 15.1,
                factors: 'Розміщення ЕВК',
                reason: '\tДля ефективного контролю літаючих комах слід уважно оцінити\n' +
                    'розташування кожного ЕВК, щоб максимізувати контроль\n' +
                    'літаючих комах в зоні та зменшити ризик забруднення/зараження\n' +
                    'продуктів або упаковки.'
            },
            ewk_accordance:{
                number: 15.2,
                factors: 'Відповідність ЕВК',
                reason: 'Чи наявні ЕВК правильного розміру/потужності для покриття площі,\n' +
                    'де вони встановлені?'
            },
            ewk_equipment:{
                number: 15.3,
                factors: 'ЕВК обладнані електричними\n' +
                    'решітками чи клеєвими\n' +
                    'екранами?',
                reason: 'Використовуваний тип ЕВК може впливати на частоту візитів для\n' +
                    'обслуговування. Багато ділянок, де застосовуються ЕВК з електрифікованими\n' +
                    'решітками, обслуговуються не менше 4 разів на рік. Проте, коли\n' +
                    'використовуються ЕВК обладнані клеєвими екранами, клеєві екрани\n' +
                    'можуть швидко заповнюватися протягом літніх місяців (особливо\n' +
                    'якщо вони розташовані біля зовнішніх дверей). Після заповнення,\n' +
                    'відсутність адгезійної поверхні на екрані означає, що ЕВК більше\n' +
                    'не є ефективним для перехоплення мух. Це значно збільшує ризик\n' +
                    'зараження продуктів харчування та упаковки в виробничих приміщеннях.'
            },
            is_ewk_frequency_satisfactory:{
                number: 15.4,
                factors: '\tЧи достатня частота\n' +
                    'обслуговування ЕВК?',
                reason: 'Якщо клеєві екрани заповнюються комахами повністю протягом\n' +
                    'літніх місяців, розгляньте збільшення періодичності відвідувань:\n' +
                    'змініть щомісячне на щодвохтижневе або щоквартальне на\n' +
                    'щомісячне обслуговування, залежно від рівня ризику.'
            },
            measures_to_block_insects_from_getting_inside:{
                number: 15.5,
                factors: 'Чи застосовуються відповідні\n' +
                    'заходи для блокування\n' +
                    'доступу літаючих комах у\n' +
                    'будівлю?',
                reason: 'Дверні прорізи в місцях прийому чи відвантаження\n' +
                    'сировини/продукції/товарів, як правило, зазнають\n' +
                    'вищого рівня активності літаючих комах. Поліпшення можуть бути\n' +
                    'зроблені шляхом встановлення автоматичних роликових дверей,\n' +
                    'прикріплення самозакриваючих механізмів до пішохідних дверей\n' +
                    'або ПВХ-жалюзів біля зовнішніх дверей. Ці заходи зменшать ризик\n' +
                    'проникнення шкідливого організму.'
            },
        },
    16: {
            title: 'Повзаючі комахи',
            crawling_insects_history:{
                number: 16.1,
                factors: 'Будь-яка попередня історія\n' +
                    'активності повзаючих комах\n' +
                    'вплине на природу програми\n' +
                    'моніторингу комах.\n' +
                    'Чи наявний належний рівень\n' +
                    'моніторингу повзаючих комах?',
                reason: 'Повзаючі комахи, як правило, є випадковими «втручальниками»,\n' +
                    'але деякі види, такі як цвіркуни домовики (Acheta Domesticus)\n' +
                    'або сіноїди (Psocids) можуть завершити свій життєвий цикл\n' +
                    'всередині будівлі і становлять небезпеку для продуктів\n' +
                    'харчування і упаковки. Залежно від історії активності\n' +
                    'повзаючих комах, і причетних видів, може знадобитися\n' +
                    'специфічна стратегія моніторингу повзаючих комах.'
            },
            psocoptera_monitoring:{
                number: 16.2,
                factors: 'Моніторинг сіноїдів (Psocoptera)',
                reason: 'Переконайтеся, що адекватний рівень моніторингу впроваджений\n' +
                    'на місці, особливо в зонах зберігання піддонів та верхнього каркасу,\n' +
                    'пакувальних матеріалів і в зонах, де зберігаються піддони.'
            },
            acheta_domesticus_monitoring:{
                number: 16.3,
                factors: 'Моніторинг Acheta domesticus\n' +
                    '– цвіркунів домовиків',
                reason: 'Переконайтеся, що впроваджений належний моніторинг активності\n' +
                    'цвіркунів домовиків, тому що зараження важко піддається\n' +
                    'викоріненню після встановлення. Цвіркуни знаходять притулок\n' +
                    'у важкодоступних щілинах, отворах, а також в каналах для кабелів\n' +
                    'і труб. Це перешкоджає цілеспрямованій обробці, що ускладнює та\n' +
                    'затримує контроль. Цвіркуни домовики становлять значний ризик і\n' +
                    'можуть траплятися в зонах зберігання сировини, пакувальних матеріалів,\n' +
                    'виробничих площ, у складських приміщеннях готової продукції та котельнях.\n' +
                    'Якщо відома історія активності цвіркунів домовиків на об\'єкті, то\n' +
                    'вимагається більший рівень пильності, і більше уваги слід приділяти\n' +
                    'моніторингу комах, щоб забезпечити раннє виявлення будь-якої\n' +
                    'нової активності. Підвищений рівень моніторингу може включати зони,\n' +
                    'такі як лінії перетину стін/підлоги, високі виступи та вздовж комкнікацій\n' +
                    '(кабелі, труби). Якщо це можливо, встановіть моніторингові пастки\n' +
                    'для повзаючих комах впритул до виробничого обладнання, що підпадає\n' +
                    'під ризик, або - до зон корпусу двигуна або уздовж електричного\n' +
                    'кабельного каналу.'
            },
        },
    17: {
            title: 'Таргани',
            cockroach_history:{
                number: 17.1,
                factors: 'Чи існувала історія\n' +
                    'періодичної або постійної\n' +
                    'активності тарганів на об\'єкті?',
                reason: 'Якщо виникала активність тарганів, потрібні розширена форма моніторингу\n' +
                    'та більш детальні інспекції. Кількість тарганів, що потрапили у моніторингові\n' +
                    'пастки слід ретельно фіксувати для аналізу тенденцій.'
            },
            blattella_germanica_history:{
                number: 17.2,
                factors: 'Чи траплялися прусаки на\n' +
                    'об\'єкті (Blattella germanica)?',
                reason: 'Прусаки віддають перевагу теплому, вологому середовищу, особливо там,\n' +
                    'де присутнє виробниче устаткування та обладнання. Вони можуть бути\n' +
                    'знайдені всередині устаткування для миття лотків, корпусів двигунів, під\n' +
                    'машинними панелями (обладнання/устаткування), всередині корпусів\n' +
                    'електричних вимикачів, зон двигунів холодильників (компресорів) та\n' +
                    'торгівельних автоматів. Прусаки можуть легко підніматися гладкими поверхнями,\n' +
                    'щоб займати прогалини, тріщини, щілини і порожнечі для оселища.\n' +
                    'Якщо популяція встановилась, її може бути дуже важко викорінити.\n' +
                    'Якщо існує історія активності прусаків, необхідно забезпечити більший\n' +
                    'рівень пильності та звітності персоналу об\'єкту (зіткнення з тарганами).\n' +
                    'Моніторинг повинен бути посилений, і слід проводити детальні інспекції.\n' +
                    'При необхідності забезпечте та переконайтеся, що обладнання, яке\n' +
                    'підпадає під високий ризик, візуально інспектується в рамках регулярного\n' +
                    'графіка інспекцій. Це дозволить провести локалізовану, цілеспрямовану\n' +
                    'обробку, якщо виникне необхідність.'
            },
            blatta_orientalis_history:{
                number: 17.3,
                factors: 'Чи траплялися чорні таргани на\n' +
                    'об\'єкті (Blatta orientalis)?',
                reason: 'Чорні таргани можуть зустрічатися в теплих порожнинах, стоках, зонах\n' +
                    'смітників/компакторів, підвалах, котельнях і трубопрвідних каналах.\n' +
                    'Вони використовують простір та порожнини всередині виробничого\n' +
                    'обладнання. Вони екстенсивно (широко) подорожують від місця\n' +
                    'оселища і можуть проповзати до 100 метрів у пошуках їжі. Переконайтеся,\n' +
                    'що впроваджений розширений моніторинг та проводяться ретельні інспекції.\n' +
                    'Це дозволить провести локалізовану, цілеспрямовану обробку,\n' +
                    'якщо виникне необхідність.'
            },
        },
    18: {
            title: 'Комахи-шкідники запасів (КШЗ)',
            is_spi_monitoring_applied:{
                number: 18.1,
                factors: 'Чи впроваджена програма\n' +
                    'моніторингу в зонах високого\n' +
                    'ризику для виявлення КШЗ,\n' +
                    'таких як жуки або вогнівки/молі?',
                reason: 'КШЗ пов\'язані з сухими продуктами харчування, включаючи злакові\n' +
                    'продукти, горіхи, сухофрукти, спеції, насіння, сухе молоко, чай та\n' +
                    'м\'ясні консерви. Деякі види КШЗ можуть проникати у таку упаковку,\n' +
                    'як папір, картон, целофан і фольга... Отвори проникнення дуже\n' +
                    'малі, і деякі комахи здатні проникати в крихітні прогалини в упаковках,\n' +
                    'які не були повністю загерметизовані. Це може дозволити КШЗ\n' +
                    'розвиватися всередині упаковки готового продукту. Проникнувши\n' +
                    'в упаковку з готовою продукцією (або в інші місця, де відбувається\n' +
                    'накопичення харчових залишків), всі стадії розвитку комах\n' +
                    '(яйця, личинки, лялечки і імаго) можуть бути присутні/виявлені.\n' +
                    'Переконайтеся, що відповідні моніторингові пастки встановлюються\n' +
                    'для КШЗ. Також запевніться, що проводяться належні візуальні інспекції\n' +
                    'продуктів, що зберігаються в місцях зберігання високого ризику.'
            },
            which_zones_are_covered_from_spi:{
                number: 18.2,
                factors: 'Які зони покриті для\n' +
                    'моніторингу КШЗ?',
                reason: 'Відповідні інспекції та моніторинг КШЗ вимагається в зонах високого\n' +
                    'ризику, де харчові продукти можуть піддаватися впливу активності\n' +
                    'комах під час виробничого процесу, особливо на виробничих етапах:\n' +
                    'пост-приготувальному та до-упаковочному. Існує ризик зараження\n' +
                    'харчових продуктів КШЗ у зонах: сировинних харчових матеріалів та\n' +
                    'сухих продуктів харчування; зберігання сировини.'
            },
            are_all_spi_risks_reviewed:{
                number: 18.3,
                factors: 'Чи були розглянуті всі\n' +
                    'ризики, пов\'язані з активністю\n' +
                    'КШЗ, що трапляються у\n' +
                    'процесі виробництва?',
                reason: 'Для забезпечення раннього виявлення та контролю активності КШЗ\n' +
                    'у зонах високого ризику, слід проводити інспекцію та моніторинг\n' +
                    'основного устаткування та обладнання у виробничій зоні. Це\n' +
                    'включає в себе механізми/обладнання, що відноситься до групи\n' +
                    'високого ризику, таке як: - блоки обладнання для контролю пилу,\n' +
                    'конвеєри та гвинтові конвеєри, просіювальні машини, циклони,\n' +
                    'вагові апарати, глазурувальні машини і лінії розливу. Будь-яке\n' +
                    'обладнання, в якому замкнений повітряний простір/пустоти\n' +
                    'можуть спричинити скупчення харчових залишків, такі як системи,\n' +
                    'що працюють з повітрям, канали, лотки (перевантажувальні) або\n' +
                    'пневматичні конвеєри. Периферійні місця поблизу основної\n' +
                    'виробничої зони також є областями з високим рівнем ризику,\n' +
                    'оскільки вони можуть слугувати притулком для КШЗ та викликати\n' +
                    'повторне зараження виробничого обладнання після його очищення.\n' +
                    'Існує багато потенційних периферійних зон високого ризику, але\n' +
                    'типовими прикладами можуть бути корпуси електричних вимикачів,\n' +
                    'канали електропроводки, лотки з електричними кабелями,\n' +
                    'горизонтальні поверхні та виступи на висоті, а також лінії перетину\n' +
                    'стін/підлоги у ділянках виробництва продуктів харчування.'
            },
        }};

let oorsho_datatables = {};

function create_textarea_modal(id){
    let data = document.getElementById(`${id}_container`).innerText;
    let modal_dialog = `
    <div class="modal-dialog modal-dialog-centered">
            <div class="modal-content border-0">
                <div class="modal-header p-3 bg-soft-info">
                    <h5 class="modal-title" id="modal-title">Добавити коментар</h5>
                    <button type="button" class="btn-close" data-bs-dismiss="modal"
                            aria-hidden="true"></button>
                </div>
                <div class="modal-body p-4">
                  <div class="row">
                            <div class="col-12">
                                 <textarea name="${id}" cols="20" rows="10"
                                                                    maxlength="4000"
                                                                    class="form-control" required=""
                                                                    data-dl-input-translation="true">${data}</textarea>
                              </div>
                        </div>

                        <div class="hstack gap-2 justify-content-end mt-2">
                            <button type="button" class="btn btn-ghost-success" onclick='write_field_data({
                                      id: "${ooorsho_id}",
                                      textarea_id: "${id}",
                                      })'>Зберегти</button>
                        </div>
                    </form>
                </div>
            </div> <!-- end modal-content-->
        </div> <!-- end modal dialog-->
      `;

    let modal = $('#textarea-modal');
    modal.append(modal_dialog);
    modal.modal('show');
}

function create_add_photo_modal(id){
    let data = document.getElementById(`${id}_photo_td`).innerText;
    let modal_dialog = `        
        <div class="modal-dialog modal-dialog-centered">
            <div class="modal-content border-0">
                <div class="modal-header p-3 bg-soft-info">
                    <h5 class="modal-title" id="modal-title">Добавити коментар</h5>
                    <button type="button" class="btn-close" data-bs-dismiss="modal"
                            aria-hidden="true"></button>
                </div>
                <div class="modal-body p-4">
                    <div id="${id}_container"
                         class="row align-items-center">
                      <div class="col-md-8 col-lg-9">
                        <div class="dropzone">
                          <div class="fallback">
                            <input name="file" type="file" multiple="multiple">
                          </div>
                          <div class="dz-message needsclick">
                            <div class="mb-3">
                              <i class="display-4 text-muted ri-upload-cloud-2-fill"></i>
                            </div>

                            <h4>Drop files here or click to upload.</h4>
                          </div>
                        </div>

                        <ul class="list-unstyled mb-0" id="dropzone-preview">
                          <li class="mt-2" id="dropzone-preview-list">
                            <!-- This is used as the file preview template -->
                            <div class="border rounded">
                              <div class="d-flex p-2">
                                <div class="flex-shrink-0 me-3">
                                  <div class="avatar-sm bg-light rounded">
                                    <img data-dz-thumbnail class="img-fluid rounded d-block"
                                         alt="Dropzone-Image"/>
                                  </div>
                                </div>
                                <div class="flex-grow-1">
                                  <div class="pt-1">
                                    <h5 class="fs-14 mb-1" data-dz-name>&nbsp;</h5>
                                    <p class="fs-13 text-muted mb-0" data-dz-size></p>
                                    <strong class="error text-danger" data-dz-errormessage></strong>
                                  </div>
                                </div>
                                <div class="flex-shrink-0 ms-3">
                                  <button data-dz-remove class="btn btn-sm btn-danger">Delete
                                  </button>
                                </div>
                              </div>
                            </div>
                          </li>
                        </ul>
                      </div>
                      <div class="col-2 ">
                        <button
                            class="btn btn-light position-relative p-0 avatar-xs rounded-circle"
                            type="button" onclick='write_field_data({
                            id: "{{ ooorsho.id }}",
                            textarea_id: "outside_factors",
                            })'>
                          <i class="fw-bold mdi mdi-plus label-icon align-middle rounded-pill fs-16 mx-1"></i>
                        </button>
                      </div>
                    </div>
                </div>
            </div> <!-- end modal-content-->
        </div> <!-- end modal dialog-->
      `;

    let modal = $('#oorsho-photo-add-modal');
    modal.append(modal_dialog);
    modal.modal('show');
}

// function create_section(section, body){
//     let html_section = `
//             <div class="accordion accordion-flush card card-animate shadow-hover m-1">
//
//               <div class="card-body p-0">
//                 <h2 class="accordion-header m-2" id="headingOne_${section}">
//                    <button id="btn_accordion_${section}" class="accordion-button fw-bold collapsed" type="button" data-bs-toggle="collapse"
//                            data-bs-target="#collapseOne_${section}" aria-expanded="true" aria-controls="collapseOne_${section}">
//                     ${section}. ${body.title}
//                   </button>
//                 </h2>
//                 <div id="collapseOne_${section}" class="accordion-collapse collapse" aria-labelledby="headingOne_${section}"
//                      data-bs-parent="#default-accordion-example">
//                       <div class="accordion-body">
//                         <div class="row">
//                             <div class="col-12">
//                                 <table id="table_${section}"  class="table table-bordered dt-responsive table-striped table-hover align-middle" style="width: 100%">
//                                   <thead class="">
//                                   <tr>
//                                     <th style="width: 4%;">№</th>
//                                     <th style="width: 17%;">Фактори</th>
//                                     <th style="width: 23%;">Міркування (розгляд)</th>
//                                     <th style="width: 50%;">Коментар</th>
//                                     <th style="width: 6%;">Фото</th>
//                                   </tr>
//                                   </thead>
//                                   <tbody id="section_${section}" class="list form-check-all">
//                                   </tbody>
//                                 </table>
//                         </div>
//                         </div>
//                     </div>
//                 </div>
//               </div>
//             </div>`;
//     return html_section;
// }
function create_section(section, body){
    let html_section = `
            <div class="accordion accordion-flush card card-animate shadow-hover m-1">
                
              <div class="card-body p-0">
                <h2 class="accordion-header m-2" id="headingOne_${section}">
                   <button id="btn_accordion_${section}" class="accordion-button fw-bold collapsed" type="button" data-bs-toggle="collapse"
                           data-bs-target="#collapseOne_${section}" aria-expanded="true" aria-controls="collapseOne_${section}">
                    ${section}. ${body.title}
                  </button>
                </h2>
                <div id="collapseOne_${section}" class="accordion-collapse collapse" aria-labelledby="headingOne_${section}"
                     data-bs-parent="#default-accordion-example">
                      <div class="accordion-body">
                        <div class="row">
                            <div id="section_${section}" class="col-12">
                            
                              
                              
                         
                            </div>
                        </div>
                    </div>
                </div>
              </div>
            </div>`;
    return html_section;
}


// function create_section_theme(section, theme, body){
//  let html_section_theme = `
//                       <tr>
//                           <td>${body.number}</td>
//                           <td class="text-wrap">${body.factors}</td>
//                           <td class="text-wrap">${body.reason}</td>
//                           <td class="text-wrap" id="${theme}_td">
//                           </td>
//                           <td class="text-wrap" id="${theme}_photo_td">
//                           </td>
//                       </tr>`;
//     return html_section_theme;
// }


function create_section_theme(section, theme, body){
 let html_section_theme = `
                      <div class="row mb-3 border border-light border-4">
                        <div class="col-12">
                            <h6 class="text-dark mt-2 mb-1"><span class="fw-bold">${body.number}</span></h6>
                        </div>
                        <div class="col-12 mb-2 border-bottom border-light border-2">
                            <p class="text-dark mb-1"><span class="fw-bold">Фактор: </span>${body.factors}</p>
                        </div>
                        <div class="col-12 mb-2 border-bottom border-light border-2">
                            <p class="text-dark mb-1"><span class="fw-bold">Міркування розгляд: </span>${body.reason}</p>
                        </div>
                        <div class="col-12 mb-1">
                            <div id="${theme}_td" class="row">
                                
                            </div>
                        </div>
                        
                      </div>
                            
                      `;
    return html_section_theme;
}

function create_approve_button(){
    let html_approve_button = `
        <div id="approve_btn" class="row mt-3">
            <div class="col-12">
                <button type="button" data-bs-toggle="modal" href="#oorsho-approve-modal" class="btn btn-success waves-effect waves-light float-end" >
                    <i class="mdi mdi-check-all me-1"></i> Затвердити ОООРШО
                </button>
            </div>
        </div>
    `;
    return html_approve_button;
}

function make_approve_modal() {
    let approve_modal = `<div class="modal-dialog modal-dialog-centered">
            <div class="modal-content">
                <div class="modal-header">
                    <button type="button" class="btn-close" data-bs-dismiss="modal" aria-label="Close" id="close-modal"></button>
                </div>
                <div class="modal-body">
                    <div class="mt-2 text-center">
                        <lord-icon
                            src="https://cdn.lordicon.com/tdrtiskw.json"
                            trigger="loop"
                            colors="primary:#f7b84b,secondary:#5426b2"
                            style="width:130px;height:130px">
                        </lord-icon>                        
                        <div class="mt-4 pt-2 fs-15 mx-2 mx-sm-5">
                            <h4>Затвердження ОООРШО</h4>
                            <p class="text-muted mx-2 mb-0">Ви дійсно бажаєте затвердити дане ОООРШО?</p>
                            <p class="text-muted mx-2 mb-0">Після затвердження вности зміни, в цю редакцію, буде не можливо.</p>
                        </div>
                    </div>
                    <div class="d-flex gap-2 justify-content-center mt-4 mb-2">
                        <button type="button" class="btn w-sm btn-light" data-bs-dismiss="modal">Назад</button>
                        <button type="button" onclick="approve_ooorsho()" class="btn w-sm btn-success" data-bs-dismiss="modal">Так, затвердити!</button>
                    </div>
                </div>
            </div><!-- /.modal-content -->
        </div>
                                `;
    return approve_modal;
}

function save_photo(ooorsho_id, id){
    const csrftoken = getCookie('csrftoken');
    let data = {};
    let field_val;

    // data = {
    //     'id': ooorsho_id,
    //     'field': id,
    //     'images': fileInput.files,
    // };

    const formData = new FormData();
    const selectedFiles = fileInput.files;

    for (let i = 0; i < selectedFiles.length; i++) {
        formData.append("file", selectedFiles[i]);
    }
    formData.append("id", ooorsho_id);
    formData.append("field", id);
    console.log(formData.getAll("field"));

    const url = `/ooorsho/add_photo/`;
    fetch(url, {
        method: 'POST',
        headers: {
            'X-CSRFToken': csrftoken,
        },
        body: formData,
    })
    .then(response => {
                if (!response.ok) {
                    throw new Error('Network response was not ok');
                }
                return response.json();
            })
    .then(responseData => {
        $('#upload_photo_modal').modal('hide');
        $('#upload_photo_modal').modal('dispose');
    })
    .catch(error => {
        console.error('Error:', error);
        notify('Помилка при вивантаженні зображень', 'alert-danger');
    });
}

function make_upload_modal(id) {
    let modal = $('#upload_photo_modal');
    document.getElementById(`upload_photo_modal_label`).innerText = `Завантажити фото`;

    $("#upload_save_btn").on("click", function (){
        save_photo(ooorsho_id, id);
    });
    modal.modal('show');
    modal.on('hidden.bs.modal', function () {
        fileInput.files = null;
        $('#dropzone-preview').empty();
    });
}

function make_photo_modal(id) {
    let field_images = [];
    let indicators = document.getElementById(`carousel_photo_indicator`);
    let images = document.getElementById(`carousel_images`);

    ooorsho_images.forEach(function (item, index) {

        if(item.field_name === id){
            console.log(item.field_name);
        console.log(id);
            field_images.push(item);
            if(index === 0){
                indicators.innerHTML += `<button type="button" data-bs-target="#carousel_photo" data-bs-slide-to="${index}" class="active"></button>`;
            images.innerHTML += `<div class="carousel-item active">
                      <img class="d-block img-fluid mx-auto" src="${item.image}" alt="${index} slide">
                  </div>`;

            }else{
                indicators.innerHTML += `<button type="button" data-bs-target="#carousel_photo" data-bs-slide-to="${index}" class=""></button>`;
            images.innerHTML += `<div class="carousel-item">
                      <img class="d-block img-fluid mx-auto" src="${item.image}" alt="${index} slide">
                  </div>`;

            }
        }
    });

    console.log(field_images);
    let modal = $('#oorsho_photo_show_modal');
    document.getElementById(`oorsho_photo_show_modal_label`).innerText = `Перегляд фото`;


    modal.modal('show');
    modal.on('hidden.bs.modal', function () {
        images.innerHTML = '';
        indicators.innerHTML = '';
    });
}

function approve_ooorsho(){
    const csrftoken = getCookie('csrftoken');
    let data = {
        'id': ooorsho_id,
        'approved': true,
    };
    const url = `/ooorsho/approve/`;
    fetch(url, {
        method: 'POST',
        headers: {
            'Content-Type': 'application/json',
            'X-CSRFToken': csrftoken,
        },
        body: JSON.stringify(data),
    })
    .then(response => {
                if (!response.ok) {
                    throw new Error('Network response was not ok');
                }
                return response.json();
            })
    .then(responseData => {
        close_ooorsho();
    })
    .catch(error => {
        console.error('Error:', error);
        notify('Помилка при затвердженні ОООРШО', 'alert-danger');
    });
}


function create_oorsho2(){
   for(let section in sections){
       let html_section = create_section(section, sections[section]);
       document.getElementById('ooorsho_main').innerHTML += html_section;


       for(let theme in sections[section]){
           if(theme === 'title'){
               continue;
           }else {
                let html_section_theme = create_section_theme(section, theme, sections[section][theme]);
                document.getElementById(`section_${section}`).innerHTML += html_section_theme;
           }
       }

   }


}

// function create_textarea_td(id, data) {
//     let body = `<div class="row align-items-center  justify-content-center">
//                               <div class="col-md-8 col-lg-9">
//                                  <textarea name="${id}" cols="20" rows="10"
//                                                                     maxlength="4000"
//                                                                     class="form-control" required=""
//                                                                     data-dl-input-translation="true">${data}</textarea>
//                               </div>
//                               <div class="col-2 m-3">
//                                 <button type="button" class="btn btn-light position-relative p-0 avatar-xs rounded-circle" onclick='write_field_data({
//                                       id: "${ooorsho_id}",
//                                       textarea_id: "${id}",
//                                       })'>
//                                         <span class="avatar-title bg-transparent text-success">
//                                           <i class="ri-save-3-fill"></i>
//
//                                         </span>
//                                     </button>
//                               </div>
//                             </div>`;
//     document.getElementById(`${id}_td`).innerHTML = body;
// }

function create_text_td(id, data) {
    let comment = '';
    if(data){
        comment = data;
    }else{
        comment = 'Коментар відсутній.';
    }

    let body = `
                              <div id="${id}_container" class="col-md-12 col-lg-12 text-dark">
                                <p class="text-muted"><span class="fw-bold text-dark">Коментар: </span>${comment}</p>
                              </div>
                              <div class="btn-group-vertical col-xxl-4 col-xl-5 col-md-5  mt-2 mx-2">
                                <button type="button" class="btn mb-1 btn-light rounded-3" onclick='create_textarea_modal("${id}")'>
                                    <i class="ri-pencil-fill align-bottom"></i> Додати коментар
                                </button>
                                <button type="button" class="btn btn-light mb-1 rounded-3" onclick='make_upload_modal("${id}")'>
                                        <span class="avatar-title bg-transparent text-reset">
                                          <i class="ri-add-circle-fill text-success align-bottom"></i> Додати фото
                                        </span>
                                    </button>
                                <button type="button" class="btn btn-light rounded-3" onclick='make_photo_modal("${id}")'>
                                        Переглянути фото
                                    </button>
                              </div>
                              
                            `;
    document.getElementById(`${id}_td`).innerHTML = body;
}


function create_photo_td(id, data) {
    let body = `<div class="row">
                              
                        </div>`;
    document.getElementById(`${id}_photo_td`).innerHTML = body;
}




function create_closed_text_td(id, data) {
    let body = `<div class="row align-items-center  justify-content-center">
                              <div id="${id}_container" class="col-md-11 col-lg-11">
                                ${data}                             
                              </div>
                              
                            </div>`;
    document.getElementById(`${id}_td`).innerHTML = body;
}


function prepare_ooorsho_data(){
    console.log(ooorsho_dict)
    for(let field in ooorsho_dict){
         if(field == 'date'){
            continue;
        }else if(field == 'version'){
            continue;
        }else if(field == 'approved'){
            continue;
        }else if(field == 'object'){
            continue;
        }else if(field == 'inspector'){
            continue;
        }else{
        // if(field !== 'date' && field !== 'version' && field !== 'approved' && field !== 'object' && field !== 'inspector') {

            if(ooorsho_dict[field]) {
                create_text_td(field, ooorsho_dict[field]);
            } else {
                create_text_td(field, '');
            }
            // if(ooorsho_dict[field]) {
            //     create_photo_td(field, ooorsho_dict[field]);
            // } else {
            //     create_photo_td(field, '');
            // }

            // create_text_td(field, ooorsho_dict[field]);
        }
    }
}

function close_ooorsho() {
    for (let field in ooorsho_dict) {
        if (field == 'date') {
            continue;
        } else if (field == 'version') {
            continue;
        } else if (field == 'approved') {
            continue;
        } else if (field == 'object') {
            continue;
        } else if (field == 'inspector') {
            continue;
        } else {

            if (ooorsho_dict[field]) {
                create_closed_text_td(field, ooorsho_dict[field]);
            } else {
                create_closed_text_td(field, '');

            }
            // create_text_td(field, ooorsho_dict[field]);
        }
    }
    let approve_btn = document.getElementById('approve_btn');
    approve_btn.remove();
}

window.addEventListener("load", (event) => {
    for (let i = 1; i < widgets.length; i++) {
        // console.log($('#id_'+widgets[i]).on('click', field_to_db));

    }
    create_oorsho2();
    console.log("page is fully loaded");
    if (ooorsho_dict['approved']) {
        close_ooorsho();
    } else {
        prepare_ooorsho_data();
        let html_approve_btn = create_approve_button();
        document.getElementById('ooorsho_main').innerHTML += html_approve_btn;
        let html_approve_modal = make_approve_modal();
        document.getElementById('oorsho-approve-modal').innerHTML += html_approve_modal;

    }
    for(let section in sections){
        let btn = $(`#btn_accordion_${section}`);
       console.log(btn)
         btn.on('click', function (){
            console.log(`btn_accordion_${section}`)
            if(oorsho_datatables[section]){
             oorsho_datatables[section].destroy();
            }
            let dt = new DataTable(`#table_${section}`, {
                                "ordering":  false,
                                paging: false,
                                searching: false,
                                "footerCallback": false,
                                "info": false,
                            });
            oorsho_datatables[section] = dt;
         });
    }
});


function write_field_data(data_template)
{
    const csrftoken = getCookie('csrftoken');
    let data = {};
    let field_val;
    if(data_template.textarea_id === 'approved'){
        field_val = true;
        data = {
            'id': data_template.id,
            'field': data_template.textarea_id,
            'field_val': field_val,
        };
    }else{
       field_val = $(`textarea[name="${data_template.textarea_id}"]`).val();
       // let field_val = $('textarea[name="'+data_template['textarea_id']+'"]').val();
       data = {
            'id': data_template.id,
            'field': data_template.textarea_id,
            'field_val': field_val,
        };
    }
    $.ajax({
        type: 'POST',
        headers: {'X-CSRFToken': csrftoken},
        url: 'update',
        data: data,
        success: function (data) {
            if(data_template.textarea_id !== 'approved') {
                $(`#${data_template.textarea_id}_td`).empty();
                create_text_td(data_template.textarea_id, field_val);
            }else if(data_template.textarea_id === 'approved'){
                close_ooorsho();
            }
            let modal = $('#textarea-modal');
            modal.empty();
            modal.modal('hide');
        },
        dataType: 'json',
    });
}

// function prepare_update_field_data(data_template) {
//     let field_val = document.getElementById(`${data_template.textarea_id}_container`).innerText;
//     create_textarea_td(data_template.textarea_id, field_val);
// }

// function update_field_data(data_template)
// {
//     const csrftoken = getCookie('csrftoken');
//     let data = {
//         id: data_template.id,
//         field: data_template.textarea_id,
//         field_val: field_val,
//     };
//     const url = `/object/planL/${slug}/${floor_plan.slug}/change-hub-location`;
//
//     fetch(url, {
//         method: 'POST',
//         headers: {
//             'Content-Type': 'application/json',
//             'X-CSRFToken': csrftoken,
//         },
//         body: JSON.stringify(data),
//     })
//         .then(response => {
//             if (!response.ok) {
//                 throw new Error('Network response was not ok');
//             }
//             return response.json();
//         })
//         .then(responseData => {
//                 // Обробка отриманих даних з сервера
//             })
//         .catch(error => {
//                 console.error('Error:', error);
//             });
// }

// function photo_field_to_db(data_template)
// {
//     const csrftoken = getCookie('csrftoken');
//     let data = {
//         hub_id: hub.id,
//         x: hub.x,
//         y: hub.y,
//         floor_id: hub.floor_id,
//     };
//     const url = `/object/planL/${slug}/${floor_plan.slug}/change-hub-location`;
//
//     fetch(url, {
//         method: 'POST',
//         headers: {
//             'Content-Type': 'application/json',
//             'X-CSRFToken': csrftoken,
//         },
//         body: JSON.stringify(data),
//     })
//         .then(response => {
//             if (!response.ok) {
//                 throw new Error('Network response was not ok');
//             }
//             return response.json();
//         })
//         .then(responseData => {
//                 // Обробка отриманих даних з сервера
//             })
//             .catch(error => {
//                 console.error('Error:', error);
//             });
// };